tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "nikitabobko/tap"
brew "bat"
brew "btop"
brew "detox"
brew "direnv"
brew "duf"
brew "dust"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "lsd"
brew "neovim"
brew "p7zip"
brew "rename"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "uutils-coreutils"
brew "wget"
brew "zoxide"
brew "felixkratz/formulae/borders"
cask "aerospace"
cask "cursorcerer"
cask "firefox"
cask "font-iosevka-curly"
cask "font-noto-emoji"
cask "font-sarabun"
cask "font-sarasa-gothic"
cask "font-symbols-only-nerd-font"
cask "karabiner-elements"
cask "kitty"
cask "spotify"
cask "whatsapp"
