brew "openssl@3"
brew "bat"
brew "btop"
brew "ccat"
brew "cdrtools"
brew "detox"
brew "direnv"
brew "duf"
brew "exiftool"
brew "fd"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "handbrake"
brew "imagemagick"
brew "lf"
brew "lsd"
brew "mprocs"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "par2"
brew "python@3.14"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "tmux"
brew "unzip"
brew "uutils-coreutils"
brew "wget"
brew "zoxide"
cask "betterdisplay"
cask "cursorcerer"
cask "font-iosevka-aile"
cask "font-iosevka-curly"
cask "font-iosevka-etoile"
cask "font-sarabun"
cask "font-sarasa-gothic"
cask "font-symbols-only-nerd-font"
cask "gstreamer-runtime"
cask "handbrake-app"
cask "hhkb"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "kid3"
cask "kitty"
cask "macfuse"
cask "movist-pro"
cask "utm"
cask "wine-stable"
