# Cryptography and SSL/TLS Toolkit
brew 'openssl@3'
# Clone of cat(1) with syntax highlighting and Git integration
brew 'bat'
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew 'btop'
# Like cat but displays content with syntax highlighting
brew 'ccat'
# CD/DVD/Blu-ray premastering and recording software
brew 'cdrtools'
# Utility to replace problematic characters in filenames
brew 'detox'
# Load/unload environment variables based on $PWD
brew 'direnv'
# Terminal visual disk space navigator
brew 'diskonaut'
# Disk Usage/Free Utility - a better 'df' alternative
brew 'duf'
# Simple, fast and user-friendly alternative to find
brew 'fd'
# Play, record, convert, and stream select audio and video codecs
brew 'ffmpeg'
# User-friendly command-line shell for UNIX-like operating systems
brew 'fish'
# Command-line fuzzy finder written in Go
brew 'fzf'
# GNU compiler collection
brew 'gcc'
# GitHub command-line tool
brew 'gh'
# Distributed revision control system
brew 'git'
# Open source programming language to build simple/reliable/efficient software
brew 'go'
# Open-source video transcoder available for Linux, Mac, and Windows
brew 'handbrake'
# Tools and libraries to manipulate images in select formats
brew 'imagemagick'
# Clone of ls with colorful output, file type icons, and more
brew 'lsd'
# Run multiple commands in parallel
brew 'mprocs'
# Incremental parsing library
brew 'tree-sitter'
# Ambitious Vim-fork focused on extensibility and agility
brew 'neovim'
# Open-source, cross-platform JavaScript runtime environment
brew 'node'
# 7-Zip (high compression file archiver) implementation
brew 'p7zip'
# Parchive: Parity Archive Volume Set for data recovery
brew 'par2'
# Shell command parallelization utility
brew 'parallel'
# PDF rendering library (based on the xpdf-3.0 code base)
brew 'poppler'
# Interpreted, interactive, object-oriented programming language
brew 'python@3.14'
# Search tool like grep and The Silver Searcher
brew 'ripgrep'
# Utility that provides fast incremental file transfer
brew 'rsync'
# Cross-shell prompt for astronauts
brew 'starship'
# Terminal multiplexer
brew 'tmux'
# Extraction utility for .zip compressed archives
brew 'unzip'
# Cross-platform Rust rewrite of the GNU coreutils
brew 'uutils-coreutils'
# Internet file retriever
brew 'wget'
# Blazing fast terminal file manager written in Rust, based on async I/O
brew 'yazi'
# Shell extension to navigate your filesystem faster
brew 'zoxide'
# Transfer files from and to an Android smartphone
cask 'android-file-transfer'
# Tool to flash OS images to SD cards & USB drives
cask 'balenaetcher'
# Display management tool
cask 'betterdisplay'
# E-books management software
cask 'calibre'
# UI for creating Windows installer ISO from UUPDump
cask 'crystalfetch'
# Preference Pane for controlling cursor hiding
cask 'cursorcerer'
# Fonts
cask 'font-iosevka-aile'
cask 'font-iosevka-curly'
cask 'font-iosevka-etoile'
cask 'font-sarabun'
cask 'font-sarasa-gothic'
cask 'font-symbols-only-nerd-font'
# Web browser
cask 'google-chrome'
# Open Source Multimedia Framework
cask 'gstreamer-runtime'
# Open-source video transcoder
cask 'handbrake-app'
# Allows keymap customization on HHKB HYBRID Type-S and HYBRID models
cask 'hhkb'
# Menu bar manager
cask 'jordanbaird-ice'
# Keyboard customiser
cask 'karabiner-elements'
# Audio tagger focusing on efficiency
cask 'kid3'
# GPU-based terminal emulator
cask 'kitty'
# File system integration
cask 'macfuse'
# Video format converter (transcoder)
cask 'makemkv'
# Media player
cask 'movist-pro'
# Music tagger
cask 'musicbrainz-picard'
# Offline Music Player
cask 'petrichor'
# File sharing network
cask 'soulseek'
# Network filesystem client to connect to SSH servers
cask 'sshfs-mac'
# Web browser focusing on security
cask 'tor-browser'
# Open-source BitTorrent client
cask 'transmission'
# Virtual machines UI using QEMU
cask 'utm'
# Compatibility layer to run Windows applications
cask 'wine-stable'
